<script setup>
import Img from '@/assets/images/video-preview.jpg'
import Play from '@/assets/images/icons/video-play.svg'
</script>

<template>
  <section class="about">
    <div class="about__inner container">
      <h2>Купить коммерческую технику в Нижнем Новгороде</h2>
      <div class="about__top">
        <div class="about__top-text">
          <p>Группа Компания «АГАТ» уже более 30 лет занимает лидирующие позиции на российском автомобильном рынке. Залог такой стабильности - постоянное развитие и работа над расширением и укрупнением своих активов.
          </p>
          <p>Стартовав в 1991 году в статусе официального дилера ОАО «ГАЗ» в Нижегородской области, сегодня во внушительном портфеле ГК «АГАТ» легковые автомобили премиум и эконом класса, большой кластер коммерческого транспорта и спецтехники, станции технического обслуживания и кузовного ремонта.

          </p>
          <p>За три десятка лет компания стала ярким примером успешной организации, в которой каждый новый год, что бы ни происходило в стране и мире,- это еще один открытый Дилерский центр.
          </p>
          <p>Не стал исключением и 2022 год. Казалось бы, в период нестабильности рынка, слома наработанных схем можно было бы немного отойти в тень до наступления экономического штиля. Но смелость и готовность идти в ногу с новыми тенденциями и требованиями времени позволили руководству ГК «АГАТ» сделать большой шаг вперед в новое будущее. Именно таким шагом стало получение статуса официального представителя Минского Автомобильного завода в Нижнем Новгороде.
          </p>
          <router-link class="about__top-link" to="#">Показать все</router-link>
        </div>
        <div data-fancybox data-type="iframe" data-src="https://www.youtube.com/embed/OnM_G_ESt6E?autoplay=1&mute=1" class="about__video">
          <img :src="Img" alt="КамАЗ" />
          <Play class="about__play" />
        </div>
      </div>
      <div class="about__bottom">
        <p>Напомним, что история Минского Автозавода началась в 1944 году, когда указом советского правительства на месте разрушенных войной авторемонтных автомастерских была организована сборка автомобилей. А уже первая пятерка грузовиков МАЗ-205 была впущена в 1947 году. Сегодня в арсенале ООО «МАЗ» грузовые автомобили, прицепы, спецтехника и автобусы. На 350-метровом конвейере МАЗа 250 человек каждые 8 часов собирают современные грузовики с двигателями Евро-6
        </p>
        <p>МАЗ – предприятие полного цикла: здесь, начиная с литейного производства и заканчивая продвижением готовой продукции, все делают сами. А с 2021 года Минский Автозавод впервые в своей истории обрел независимость и от внешних поставок силовых агрегатов – всю потребность в двигателях и коробках передач сегодня белорусы могут обеспечить за счет собственного производства. Для этих целей совместно с китайскими компаниями Weichai Power и Shaanxi Fast Gear в парке «Великий камень» под Минском были построены два новых завода. При этом моторы Mercedes-Benz, Cummins и ЯМЗ, коробки передач ZF по требованию потребителей по-прежнему будут доступны к заказу.
        </p>
        <p>Отдел продаж МАЗ ЦЕНТР АГАТ ждет вас по адресу Ларина, 23г, получить консультацию также можно по номеру +7 (831) 2-000-000. Автомобили в наличии и под заказ, более подробно ознакомиться с наличием можно в разделе на сайте https://agat-group.com/catalog-commercial/search/brand-maz/</p>
      </div>

    </div>
  </section>
</template>

<style
    scoped
    lang="scss"
>
@use '@/styles/helpers' as *;

.about {
  margin-top: 32px;
  font-size: rem(14);
  &__inner {
    display: flex;
    flex-direction: column;
    gap: fluid(16, 8);
  }

  &__top {
    margin-top: fluid(16, 8);
    display: flex;
    gap: 1rem;
    align-items: center;

    @include tablet {
      flex-direction: column;
    }

    &-text {
      display: flex;
      flex-direction: column;
      gap: fluid(16, 8);

      p {
        @include mobile {
          &:not(:first-child) {
            display: none;
          }
        }
      }
    }

    &-link {
      @include mobile-above {
        display: none;
      }
      color: var(--color-gray-dark);
      font-size: 1rem;
      @include hover {
        text-decoration: underline;
      }
    }
  }



  &__video {
    position: relative;
    overflow: hidden;
    min-width: fluid(610, 278);
    max-width: rem(324);
    @include tablet {
      max-width: 100%;
    }

    img {
      width: 100%;
      height: 100%;
      object-fit: cover;
    }
  }

  &__play {
    position: absolute;
    width: fluid(87, 56);
    height: fluid(64, 41);
    @include abs-center;
  }

  &__bottom {
    @include tablet {
      display: none;
    }
  }
}


</style>