<script setup>
import Img from '@/assets/images/video-preview.jpg'
</script>

<template>
  <section class="about">
    <div class="about__inner container">
      <h2>Купить коммерческую технику в Нижнем Новгороде</h2>
      <div class="about__body">
        <div class="about__text">Группа Компания «АГАТ» уже более 30 лет занимает лидирующие позиции на российском автомобильном рынке. Залог такой стабильности - постоянное развитие и работа над расширением и укрупнением своих активов.
          <br><br>

          Стартовав в 1991 году в статусе официального дилера ОАО «ГАЗ» в Нижегородской области, сегодня во внушительном портфеле ГК «АГАТ» легковые автомобили премиум и эконом класса, большой кластер коммерческого транспорта и спецтехники, станции технического обслуживания и кузовного ремонта.
          <br><br>

          За три десятка лет компания стала ярким примером успешной организации, в которой каждый новый год, что бы ни происходило в стране и мире,- это еще один открытый Дилерский центр.
          <br><br>

          Не стал исключением и 2022 год. Казалось бы, в период нестабильности рынка, слома наработанных схем можно было бы немного отойти в тень до наступления экономического штиля. Но смелость и готовность идти в ногу с новыми тенденциями и требованиями времени позволили руководству ГК «АГАТ» сделать большой шаг вперед в новое будущее. Именно таким шагом стало получение статуса официального представителя Минского Автомобильного завода в Нижнем Новгороде.
          <br><br>

          Напомним, что история Минского Автозавода началась в 1944 году, когда указом советского правительства на месте разрушенных войной авторемонтных автомастерских была организована сборка автомобилей. А уже первая пятерка грузовиков МАЗ-205 была впущена в 1947 году. Сегодня в арсенале ООО «МАЗ» грузовые автомобили, прицепы, спецтехника и автобусы. На 350-метровом конвейере МАЗа 250 человек каждые 8 часов собирают современные грузовики с двигателями Евро-6
          <br><br>

          МАЗ – предприятие полного цикла: здесь, начиная с литейного производства и заканчивая продвижением готовой продукции, все делают сами. А с 2021 года Минский Автозавод впервые в своей истории обрел независимость и от внешних поставок силовых агрегатов – всю потребность в двигателях и коробках передач сегодня белорусы могут обеспечить за счет собственного производства. Для этих целей совместно с китайскими компаниями Weichai Power и Shaanxi Fast Gear в парке «Великий камень» под Минском были построены два новых завода. При этом моторы Mercedes-Benz, Cummins и ЯМЗ, коробки передач ZF по требованию потребителей по-прежнему будут доступны к заказу.
          <br><br>

          Отдел продаж МАЗ ЦЕНТР АГАТ ждет вас по адресу Ларина, 23г, получить консультацию также можно по номеру +7 (831) 2-000-000. Автомобили в наличии и под заказ, более подробно ознакомиться с наличием можно в разделе на сайте https://agat-group.com/catalog-commercial/search/brand-maz/</div>
        <div class="about__video">
          <img
              :src="Img"
              alt=""
          >
        </div>
      </div>
    </div>
  </section>
</template>

<style
    scoped
    lang="scss"
>
@use '@/styles/helpers' as *;

.about {
  &__inner {
    display: flex;
    flex-direction: column;

  }

  &__body {
    display: grid;
    grid-template-columns: repeat(2, 1fr);
    grid-template-rows: repeat(2, 1fr);
    gap: 1rem;
    grid-template-areas:
        "text image"
        "text text"
  ;
  }

  &__text {
    grid-area: text;
  }

  &__video {
    grid-area: image;
  }
}
</style>